# Используйте официальный образ Python в качестве базового
FROM python:3.12

# Установите переменную окружения для предотвращения буферизации вывода Python
ENV PYTHONUNBUFFERED=1

# Установите рабочую директорию внутри контейнера
WORKDIR /app

# Скопируйте только файл зависимостей сначала
COPY requirements.txt .

# Установите зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Теперь скопируйте все файлы вашего приложения в контейнер
COPY . .

EXPOSE 8000

# Укажите команду для запуска приложения (например, сервер разработки)
CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]
